lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-v.c
/*
 * Copyright (c) 2026 Oray Inc. All rights reserved.
 * Copyright (C) 2022-2026 OraySZ / OrayOS-Team.
 *
 * This work is licensed under CC BY-NC-SA 4.0.
 * To view a copy of this license, visit:
 * https://creativecommons.org/licenses/by-nc-sa/4.0/
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *
 * File:     ch32-v.c
 * Author:   lintel <lintel.huang@gmail.com>
 * Date:     2026-04-20
 *
 * Description:
 *     WCH CH32 系列 minimal SoC（QingKe + 片内 Flash/SRAM）。外设实现已拆至
 *     ch32-*.c（Flash、RCC、STK/PFIC、RTC/RNG/ADC、IWDT、GPIO/AFIO、USART、以太网）。
 */

#include "qemu/osdep.h"
#include "qemu/cutils.h"
#include "qemu/error-report.h"
#include "qemu/module.h"
#include "qapi/error.h"
#include "hw/boards.h"
#include "hw/loader.h"
#include "system/address-spaces.h"
#include "system/memory.h"
#include "system/tcg.h"
#include "hw/intc/riscv_aclint.h"
#include "target/riscv/cpu_bits.h"
#include "hw/qdev-core.h"
#include "hw/core/cpu.h"
#include "ch32-machine-internal.h"

#include <errno.h>
#include <glib/gstdio.h>    /* GStatBuf, g_stat — not implicit on MinGW */

/*
 * SRAM / 外设总线背景 IO：0x20000000 片内 SRAM 与 0x40000000 外设总线
 * 之间的地址间隙，以及外设区未建模的地址带。部分固件会沿 SRAM 连续
 * 探测直至出现总线 fault；若整段 unmap，易在 FreeRTOS 队列边界处误伤。
 * 此处用 MMIO 占位（读 0 / 写忽略），使探测可穿过该带而不触发异常。
 * 注意：该 ops 同时被用作 periph_bus_ram 的背景 IO（见 machine_init）。
 *
 */
static uint64_t ch32_sram_gap_read(void *opaque, hwaddr addr, unsigned size)
{
    (void)opaque;
    (void)addr;
    (void)size;
    return 0;
}

static void ch32_sram_gap_write(void *opaque, hwaddr addr, uint64_t val,
                                unsigned size)
{
    (void)opaque;
    (void)addr;
    (void)val;
    (void)size;
}

static const MemoryRegionOps ch32_sram_gap_ops = {
    .read = ch32_sram_gap_read,
    .write = ch32_sram_gap_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 8,
    },
    .impl = {
        .min_access_size = 1,
        .max_access_size = 8,
    },
};

static void ch32_mtimer_quiesce_mtip(void)
{
    hwaddr addr = CH32_QEMU_CLINT_BASE + RISCV_ACLINT_SWI_SIZE
                + RISCV_ACLINT_DEFAULT_MTIMECMP;
    uint64_t v = UINT64_MAX;
    MemTxResult r;

    r = address_space_write(&address_space_memory, addr,
                            MEMTXATTRS_UNSPECIFIED, &v, sizeof(v));
    if (r != MEMTX_OK) {
        error_report("ch32: could not clear ACLINT MTIP (mtimecmp write): %d",
                     (int)r);
        exit(EXIT_FAILURE);
    }
}

static void ch32_machine_instance_init(Object *obj)
{
    Ch32MachineState *s = CH32_MACHINE(obj);
    s->boot_mode = CH32_BOOT_FLASH; /* 默认：程序闪存存储器启动 */
}

static char *ch32_prop_get_flash_image(Object *obj, Error **errp)
{
    Ch32MachineState *s = CH32_MACHINE(obj);

    (void)errp;
    return g_strdup(s->flash_image ? s->flash_image : "");
}

static void ch32_prop_set_flash_image(Object *obj, const char *value, Error **errp)
{
    Ch32MachineState *s = CH32_MACHINE(obj);

    (void)errp;
    g_free(s->flash_image);
    s->flash_image = g_strdup(value ? value : "");
}

static char *ch32_prop_get_flash_size(Object *obj, Error **errp)
{
    Ch32MachineState *s = CH32_MACHINE(obj);

    (void)errp;
    return g_strdup_printf("%" PRIu64, s->flash_size_cfg);
}

static void ch32_prop_set_flash_size(Object *obj, const char *value, Error **errp)
{
    Ch32MachineState *s = CH32_MACHINE(obj);
    uint64_t v;

    if (!value || !value[0]) {
        s->flash_size_cfg = 0;
        return;
    }
    if (qemu_strtosz(value, NULL, &v) < 0) {
        error_setg(errp, "ch32: invalid flash-size: %s", value);
        return;
    }
    if (v < 4096) {
        error_setg(errp, "ch32: flash-size below minimum 4096");
        return;
    }
    if (v > 16 * MiB) {
        error_setg(errp, "ch32: flash-size above maximum 16MiB");
        return;
    }
    s->flash_size_cfg = v;
}

static char *ch32_prop_get_boot_mode(Object *obj, Error **errp)
{
    Ch32MachineState *s = CH32_MACHINE(obj);

    (void)errp;
    switch (s->boot_mode) {
    case CH32_BOOT_FLASH:  return g_strdup("flash");
    case CH32_BOOT_SYSMEM: return g_strdup("sysmem");
    case CH32_BOOT_SRAM:   return g_strdup("sram");
    default:               return g_strdup("flash");
    }
}

static void ch32_prop_set_boot_mode(Object *obj, const char *value, Error **errp)
{
    Ch32MachineState *s = CH32_MACHINE(obj);

    if (!value || !strcmp(value, "") || !strcmp(value, "flash")) {
        s->boot_mode = CH32_BOOT_FLASH;
    } else if (!strcmp(value, "sysmem") || !strcmp(value, "system")) {
        s->boot_mode = CH32_BOOT_SYSMEM;
    } else if (!strcmp(value, "sram")) {
        s->boot_mode = CH32_BOOT_SRAM;
    } else {
        error_setg(errp, "ch32: invalid boot-mode '%s': expected flash|sysmem|sram",
                   value);
    }
}

static void ch32_machine_finalize(Object *obj)
{
    Ch32MachineState *s = CH32_MACHINE(obj);

    if (s->stk_timer) {
        timer_free(s->stk_timer);
        s->stk_timer = NULL;
    }
    if (s->iwdt_timer) {
        timer_free(s->iwdt_timer);
        s->iwdt_timer = NULL;
    }
    if (s->iwdt_flag_timer) {
        timer_free(s->iwdt_flag_timer);
        s->iwdt_flag_timer = NULL;
    }
    ch32_usbhost_machine_finalize(s);
    ch32_usbfs_host_machine_finalize(s);
    g_free(s->flash_image);
    s->flash_image = NULL;
}

static void ch32_ahb_misc_reset_defaults(Ch32MachineState *s)
{
    void *p;

    if (CH32_AHB_MISC_SIZE < CH32_EXTEN_CTR2_OFF + 4) {
        return;
    }
    p = memory_region_get_ram_ptr(&s->ahb_misc_ram);
    stl_le_p((uint8_t *)p + CH32_EXTEN_CTR_OFF, CH32_EXTEN_CTR_RESET);
    stl_le_p((uint8_t *)p + CH32_EXTEN_CTR2_OFF, CH32_EXTEN_CTR2_RESET);
    ch32_usb_reset_defaults(s);
}

/*
 * 整机软状态复位：集中重置各外设 shadow / 标志 / 计数器等不持有 MMIO
 * 资源的状态，供 ch32_machine_reset（guest reset 钩子）与 ch32_machine_init
 * （首次初始化）共用，避免两处维护重复初始化代码。
 *
 * 不在此处处理的内容：
 *   - PFIC/STK/TIM/IWDG/GPIO/DMA/USART/ETH 等子系统的复位（有专用 reset
 *     函数，由调用方按需调用）
 *   - stk_timer/iwdt_timer 等 QEMUTimer 对象的创建（仅 init 负责）
 *   - MMIO region 注册（仅 init 负责）
 */
static void ch32_soft_state_reset(Ch32MachineState *s)
{
    /* RCC shadow：HSION=1 为上电默认 */
    memset(&s->rcc_shadow, 0, sizeof(s->rcc_shadow));
    s->rcc_shadow.words[0] = 0x00000001u;

    /* Flash 寄存器影子：LOCK=1 */
    memset(s->flash_reg_shadow, 0, sizeof(s->flash_reg_shadow));
    s->flash_reg_shadow[4] = 0x00000080u;
    s->flash_unlocked = false;
    s->flash_key_step = 0;
    s->flash_ob_key_step = 0;
    s->flash_statr = 0;

    /* RNG / CRC */
    s->rng_seq = 0;
    s->rng_ctlr = 0;
    s->crc_dr  = 0xFFFFFFFFu;
    s->crc_idr = 0;

