lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-v.c
    /* WWDG / PWR / BKP */
    s->wwdg_ctlr  = 0x7fu;
    s->wwdg_cfgr  = 0x7fu;
    s->wwdg_statr = 0;
    s->pwr_ctlr = 0;
    s->pwr_csr  = 0;
    ch32_bkp_reset(s);

    /* SDIO */
    memset(s->sdio_reg, 0, sizeof(s->sdio_reg));
    s->sdio_sta = 0;

    /* RTC 实时计数状态（shadow + 虚拟时钟 epoch） */
    memset(&s->rtc_shadow, 0, sizeof(s->rtc_shadow));
    s->rtc_cnt_set = false;
    s->rtc_cnt0    = 0;
    s->rtc_base_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    s->rtc_secf_ns = 0;
    s->rtc_alr     = 0;
}

/*
 * ESIG/DBGMCU IDCODE 填充与 Flash 首指 JAL 修正已拆至 ch32-boot.c：
 *   ch32_esig_populate（导出）
 *   ch32_decode_jal_target（导出）
 *   ch32_flash_patch_vector_jal_if_needed（导出）
 */

static void ch32_machine_reset(MachineState *machine, ResetType type)
{
    Ch32MachineState *s = CH32_MACHINE(machine);

    /*
     * QEMU guest reset 路径：qemu_system_reset -> machine->reset()。
     * ch32_machine_init 只在居机启动时执行一次，此处对每次 guest reset
     * （WDT 超时等）恢复外设软状态，防止 pfic_ienr/STK timer 残留导致
     * mscratch 未初始化时 SysTick 即刻重新触发。
     */

    /* 重置 PFIC 中断使能、STK 定时器、MTIP/MSIP */
    ch32_stk_pfic_reset(s);

    /* 重置 IWDG */
    ch32_iwdt_reset(s);

    /*
     * 通用软状态复位：RCC/Flash/RNG/CRC/WWDG/PWR/BKP/SDIO/RTC shadow。
     * 与 ch32_machine_init 共享同一段初始化逻辑，避免复制粘贴漂移。
     */
    ch32_soft_state_reset(s);

    /* 重置 GPIO/AFIO */
    ch32_gpio_afio_reset(s);

    /* 重置 DMA 控制器 */
    ch32_dma_reset(s);

    /* 重置 USART2/3 + UART4~8 轻量状态（含 RX FIFO / rx_pending） */
    ch32_usart_lite_reset(s);
    ch32_usart_lite_meip_resync(s);

    /* 重置 USART1 */
    ch32_usart1_reset(s);

    /* 重置 AHB MISC（EXTEN CTR 等）和 USB 默认值 */
    ch32_ahb_misc_reset_defaults(s);

    /* 重置 SPI/I2C */
    ch32_spi_reset(s);
    ch32_i2c_reset(s);

    /*
     * WCH CH32 mc->reset 覆盖了 qemu_devices_reset，所以 CPU reset（riscv_cpu_reset_hold）
     * 不会被自动调用。必须手动触发 **每个 hart** 的 cold reset，才能确保：
     * 1. env->pc 被重置为 resetvec（flash 起始地址）
     * 2. env->mtvec 被清零（避免旧向量在 startup 之前被意外使用）
     * 3. env->wch_vtf_in_isr / wch_hpe_depth / wch_hpe_sw_handler_skip 被清零
     * 4. mstatus.MIE 被清零
     *
     * 注意：device_cold_reset(DEVICE(&s->cpus)) **不会**级联到 harts[]，
     * 因为 QEMU 10.2.2 的 RISCVHartArrayState 没有把 harts 注册为 bus child
     * 或 Resettable child。这里用通用的 CPU_FOREACH + cpu_reset 遍历，而不再
     * reach-into s->cpus.harts[] 私有数组，对上游 11.x 潜在的 hart-array
     * 自己 register children 改造具备向前兼容性（上游如果级联了 harts，
     * cpu_reset 仍然是幂等的）。
     *
     * CPU reset 必须在 ch32_stk_pfic_reset（已撤销 MTIP/MSIP/mie）之后调用，
     * 否则 riscv_cpu_reset_hold 不会清零 mie，导致复位后 SysTick 立即重新触发。
     * SRAM 内容按真机行为不清零。
     */
    {
        CPUState *cs;
        CPU_FOREACH(cs) {
            cpu_reset(cs);
        }
    }

    /*
     * ETH DMA 影子状态复位：
     * mc->reset 覆盖了 qemu_devices_reset，ch32_eth_reset（注册为 dc->reset）
     * 不会自动被调用，需手动触发。否则 WDT/软件复位后 ETH DMA 描述符环游标
     * 残留旧值，新固件重建的 DMARDLAR/DMATDLAR 与旧游标不对齐，导致
     * ETH 无法接收数据包（ARP 不响应）。
     */
    if (s->eth_state) {
        device_cold_reset(DEVICE(s->eth_state));
    }
    if (s->eth10m_state) {
        device_cold_reset(DEVICE(s->eth10m_state));
    }

    /* 重置 TIM2~TIM7 */
    ch32_tim_reset(s);
}

static void ch32_machine_init(MachineState *machine, const Ch32BoardDesc *bd)
{
    Ch32MachineState *s = CH32_MACHINE(machine);
    MemoryRegion *sysmem = get_system_memory();
    uint64_t elf_entry = CH32_FLASH_BASE;
    uint64_t reset_pc = CH32_FLASH_BASE;
    uint64_t low = 0, high = 0;
    ssize_t loaded;
    uint64_t flash_sz = s->flash_size_cfg ? s->flash_size_cfg : bd->flash_size;
    g_autofree char *flash_name = g_strdup_printf("%s.flash", bd->tag);

    /*
     * 绑定 board 描述指针，外设（如 RCC）可通过 s->board 读取
     * per-板的 HSI/HSE 频率等静态参数。
     */
    s->board = bd;

    {
        bool have_k = machine->kernel_filename && machine->kernel_filename[0];
        bool have_f = s->flash_image && s->flash_image[0];

        if (!have_k && !have_f) {
            error_report("%s: specify -kernel <file.elf> OR "
                         "-machine %s,flash-image=<file.bin|file.hex> "
                         "(raw binary or Intel HEX from 0x08000000, size <= flash)", bd->tag,
                         bd->tag);
            exit(EXIT_FAILURE);
        }
        if (have_k && have_f) {
            warn_report("%s: both -kernel and flash-image set; using -kernel",
                        bd->tag);
        }
    }

    memory_region_init_ram_nomigrate(&s->flash, OBJECT(machine), flash_name,
                                     flash_sz, &error_fatal);
    vmstate_register_ram_global(&s->flash);
    memory_region_add_subregion(sysmem, CH32_FLASH_BASE, &s->flash);

    /*
     * CH32 手册表 1-1：启动模式决定 0x00000000 映射到哪个区域。
     *
     * boot-mode=flash  (BOOT0=0, 默认)：
     *   0x00000000 映射到 Flash（0x08000000 内容）
     *   CPU resetvec = CH32_FLASH_BASE (0x08000000)
     *
     * boot-mode=sysmem (BOOT0=1, BOOT1=0)：
     *   0x00000000 映射到系统存储器（0x1FFF8000）
     *   CPU resetvec = CH32_SYSMEM_BASE (0x1FFF8000)
     *   系统存储器（BootLoader ROM）初始化为全 0xFF
     *
     * boot-mode=sram   (BOOT0=1, BOOT1=1)：
     *   0x00000000 仅能以 0x20000000 地址访问，不建立 0x00000000 映射
     *   CPU resetvec = CH32_SRAM_BASE (0x20000000)
     */
    {
        g_autofree char *sysmem_name =
            g_strdup_printf("%s.sysmem.rom", bd->tag);
        g_autofree char *boot_remap_name =
            g_strdup_printf("%s.boot.remap", bd->tag);
    
        /* 初始化系统存储器 ROM（全 0xFF）并注册到 0x1FFF8000 */
        memory_region_init_ram_nomigrate(&s->sysmem_rom, OBJECT(machine),
                                         sysmem_name, CH32_SYSMEM_SIZE,
                                         &error_fatal);
        vmstate_register_ram_global(&s->sysmem_rom);
        {
            void *sp = memory_region_get_ram_ptr(&s->sysmem_rom);
            memset(sp, 0xff, CH32_SYSMEM_SIZE);
        }
        memory_region_add_subregion(sysmem, CH32_SYSMEM_BASE, &s->sysmem_rom);
    
        switch (s->boot_mode) {
        case CH32_BOOT_FLASH:
        default:
            /*
             * 程序闪存存储器启动（默认）：
             * Flash 映射到 0x08000000，同时映射到 0x00000000。
             */
            memory_region_init_alias(&s->boot_remap, OBJECT(machine),
                                     boot_remap_name,
                                     &s->flash, 0, flash_sz);
            memory_region_add_subregion_overlap(sysmem,
                                                CH32_BOOT_REMAP_BASE,
                                                &s->boot_remap, -1);
            elf_entry = CH32_FLASH_BASE;
            break;
        case CH32_BOOT_SYSMEM:
            /*
             * 系统存储器启动：
             * 系统存储器映射到 0x1FFF8000，同时映射到 0x00000000。
             * CPU resetvec = 0x1FFF8000。
             */
            memory_region_init_alias(&s->boot_remap, OBJECT(machine),
                                     boot_remap_name,
                                     &s->sysmem_rom, 0, CH32_SYSMEM_SIZE);
            memory_region_add_subregion_overlap(sysmem,
                                                CH32_BOOT_REMAP_BASE,
                                                &s->boot_remap, -1);
            elf_entry = CH32_SYSMEM_BASE;
            break;
        case CH32_BOOT_SRAM:
            /*
             * 内部 SRAM 启动：
             * SRAM 已注册到 0x20000000，不建立 0x00000000 映射。
             * CPU resetvec = 0x20000000。
             */
            elf_entry = CH32_SRAM_BASE;
            break;
        }
    }
    
    memory_region_add_subregion(sysmem, CH32_SRAM_BASE, machine->ram);
    {
        hwaddr gap_base = CH32_SRAM_BASE + memory_region_size(machine->ram);
        hwaddr gap_len;

        if (gap_base < CH32_PERIPH_BUS_BASE) {
            gap_len = CH32_PERIPH_BUS_BASE - gap_base;
            memory_region_init_io(&s->sram_gap, OBJECT(machine), &ch32_sram_gap_ops,
                                   NULL, "ch32-sram-gap", gap_len);
            memory_region_add_subregion_overlap(sysmem, gap_base, &s->sram_gap, -1);
        }
    }

    {
        uint8_t *flash_ram = memory_region_get_ram_ptr(&s->flash);

        memset(flash_ram, 0xff, flash_sz);
    }

    if (machine->kernel_filename && machine->kernel_filename[0]) {
        loaded = load_elf_ram_sym(machine->kernel_filename,
                                    NULL, NULL, NULL,
                                    &elf_entry, &low, &high, NULL,
                                    ELFDATA2LSB, EM_RISCV,
                                    0, 0, &address_space_memory, false, NULL);
        if (loaded < 0) {
            error_report("%s: could not load ELF '%s'", bd->tag,
                         machine->kernel_filename);
            exit(EXIT_FAILURE);
        }
        /*
         * 确定复位 PC：
         *
         * 情形 A：ELF 链接到 Flash 物理地址（0x08000000 起）。
         *   elf_entry 在 [CH32_FLASH_BASE, CH32_FLASH_BASE+flash_sz) 内，
         *   且不等于基地址（避免无意义的 0x08000000 入口）。
         *   此时直接以 elf_entry 作为 resetvec。
         *
         * 情形 B：ELF 链接到 0x00000000（WCH MRS 工具链常见输出）。
         *   elf_entry 在 [0, flash_sz) 内，通过启动重映射区执行。
         *   若 elf_entry == 0，复位向量设为 0（启动重映射首地址）。
         *   若 elf_entry 非零（如 handle_reset 地址），直接使用该入口。
         *   关键：auipc 等 PC 相对指令必须在正确的地址空间（0x0000xxxx）
         *   下执行，否则 SP 等寄存器会被加上 0x08000000 偏移导致错误。
         *
         * 其他情形（elf_entry 在上述范围之外）：
         *   回退到 CH32_FLASH_BASE，行为与旧版一致。
         */
        if (elf_entry >= CH32_FLASH_BASE &&
            elf_entry < CH32_FLASH_BASE + flash_sz &&
            (elf_entry & 3) == 0 &&
            elf_entry != CH32_FLASH_BASE) {
            /* 情形 A：链接到 0x08000000 */
            reset_pc = elf_entry;
        } else if (elf_entry < flash_sz && (elf_entry & 3) == 0) {
            /* 情形 B：链接到 0x00000000，通过启动重映射执行 */
            reset_pc = elf_entry;   /* 启动重映射地址空间（0x0000xxxx） */
        } else {
            reset_pc = CH32_FLASH_BASE;
        }
        elf_entry = reset_pc;
    } else {
        uint8_t *flash_ram = memory_region_get_ram_ptr(&s->flash);
        bool is_hex = g_str_has_suffix(s->flash_image, ".hex") ||
                      g_str_has_suffix(s->flash_image, ".HEX");

        if (is_hex) {
            /*
             * Intel HEX 模式：解析 HEX 文件并按地址写入 Flash RAM。
             * 无需文件大小检查（解析器内部按地址窗口过滤）。
             */
            uint64_t hex_entry = CH32_FLASH_BASE;
            bool hex_have_ela = false;
            if (!ch32_load_hex_image(flash_ram, flash_sz, s->flash_image,
                                     &hex_entry, &hex_have_ela)) {
                error_report("%s: failed to load HEX '%s'", bd->tag, s->flash_image);
                exit(EXIT_FAILURE);
            }
            /*
             * WCH MRS 工具链生成的 HEX 通常链接到 0x00000000（无 ELA 记录）。
             * 此时代码中所有绝对地址均为 0x0000xxxx，CPU 应从启动重映射区
             * (0x00000000) 开始执行，而非 Flash 物理地址 (0x08000000)。
             * 若 HEX 含 ELA 记录（链接到 0x08000000），则保留原始入口地址。
             */
            if (!hex_have_ela) {
                elf_entry = CH32_BOOT_REMAP_BASE; /* 无 ELA：从 0 启动 */
            } else {
                elf_entry = hex_entry;
            }
        } else {
            GStatBuf sb;
            ssize_t n;

            if (g_stat(s->flash_image, &sb) != 0) {
                error_report("%s: flash-image '%s': %s", bd->tag, s->flash_image,
                             g_strerror(errno));
                exit(EXIT_FAILURE);
            }
            if ((uint64_t)sb.st_size > flash_sz) {
                error_report("%s: flash-image '%s' size %" PRIu64
                             " exceeds flash size %" PRIu64, bd->tag,
                             s->flash_image, (uint64_t)sb.st_size,
                             flash_sz);
                exit(EXIT_FAILURE);
            }
            n = load_image_size(s->flash_image, flash_ram, flash_sz);
            if (n < 0) {
                error_report("%s: could not load flash-image '%s'", bd->tag,
                             s->flash_image);
                exit(EXIT_FAILURE);
            }
            elf_entry = CH32_FLASH_BASE;
        }
    }

    {
        uint8_t *flash_ram = memory_region_get_ram_ptr(&s->flash);

        ch32_flash_patch_vector_jal_if_needed(flash_ram, flash_sz);
        /*
         * flash-image 首条常为「jal x0, 应用入口」（如前 4KiB 填 FF + 跳板），若仍从
         * reset PC 执行该 jal 会写入 ra，与 -kernel 直接把 resetvec 设为 ELF
         * 入口不同，易导致后续控制流异常。若首条为 jal x0 且目标在合理范围内，
         * 则将复位 PC 设为目标地址，与 -kernel 行为对齐。
         * 注：无 ELA 的 HEX（链接到 0x0）elf_entry=0，目标地址空间为 [0, flash_sz)；
         *     有 ELA 的 HEX/bin（链接到 0x08000000）elf_entry=0x08000000，目标在 Flash 物理范围内。
         */
        if (!(machine->kernel_filename && machine->kernel_filename[0])) {
            uint32_t w0 = ldl_le_p(flash_ram);

            if ((w0 & 0x7f) == 0x6f && ((w0 >> 7) & 0x1f) == 0) {
                uint32_t t = ch32_decode_jal_target(elf_entry, w0);
                bool t_valid;

                if (elf_entry == CH32_BOOT_REMAP_BASE) {
                    /* 无 ELA 模式：目标应在 [4, flash_sz) 且 4 字节对齐 */
                    t_valid = (t >= 4 && t < (uint32_t)flash_sz && (t & 3u) == 0u);
                } else {
                    /* 有 ELA / bin 模式：目标应在 Flash 物理范围内 */
                    t_valid = (t > CH32_FLASH_BASE && t < CH32_FLASH_BASE + flash_sz &&
                               (t & 3u) == 0u);
                }
                if (t_valid) {
                    elf_entry = t;
                }
            }
        }
    }

    object_initialize_child(OBJECT(machine), "cpus", &s->cpus,
                            TYPE_RISCV_HART_ARRAY);
    object_property_set_str(OBJECT(&s->cpus), "cpu-type",
                            machine->cpu_type, &error_abort);
    object_property_set_int(OBJECT(&s->cpus), "num-harts", 1, &error_abort);
    object_property_set_int(OBJECT(&s->cpus), "resetvec",
                            (int64_t)elf_entry, &error_abort);
    sysbus_realize(SYS_BUS_DEVICE(&s->cpus), &error_fatal);
    /*
     * USBFS 必须在 USBHS 之前初始化：qbus_init 用 QLIST_INSERT_HEAD 将
     * 子总线加入 parent，后创建的排在最前。用户 -device usb-xxx 不带 bus=
     * 时 QEMU 会选中第一个 USB 总线，USBHS 后创建所以排前面成为默认总线。
     */
    ch32_usbfs_host_machine_init(s);
    ch32_usbhost_machine_init(s);

    if (tcg_enabled()) {
        riscv_aclint_swi_create(CH32_QEMU_CLINT_BASE, 0, 1, false);
        riscv_aclint_mtimer_create(CH32_QEMU_CLINT_BASE + RISCV_ACLINT_SWI_SIZE,
                                   RISCV_ACLINT_DEFAULT_MTIMER_SIZE,
                                   0, 1,
                                   RISCV_ACLINT_DEFAULT_MTIMECMP,
                                   RISCV_ACLINT_DEFAULT_MTIME,
                                   RISCV_ACLINT_DEFAULT_TIMEBASE_FREQ, true);
        ch32_mtimer_quiesce_mtip();
    }

    ch32_usart1_init_mr(s, OBJECT(machine));
    memory_region_add_subregion_overlap(
        sysmem, CH32_USART1_BASE,
        &s->usart1.iomem, 2);

