lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-v.c
    /*
     * 通用软状态初始化：RCC/Flash/RNG/CRC/WWDG/PWR/BKP/SDIO/RTC shadow。
     * 与 ch32_machine_reset 共享同一段代码（ch32_soft_state_reset）。
     */
    ch32_soft_state_reset(s);

    /* PFIC / STK 模拟所需的独立软状态（不属于 soft_state_reset） */
    memset(&s->stk, 0, sizeof(s->stk));
    memset(s->pfic_ienr, 0, sizeof(s->pfic_ienr));
    s->stk_epoch_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    s->stk_cnt_at_epoch = 0;
    s->stk_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL, ch32_stk_tick, s);

    ch32_gpio_afio_reset(s);

    {
        g_autofree char *n = g_strdup_printf("%s.dbgmcu.ram", bd->tag);

        memory_region_init_ram_nomigrate(&s->dbg_ram, OBJECT(machine), n,
                                         CH32_DBGMCU_SIZE, &error_fatal);
        vmstate_register_ram_global(&s->dbg_ram);
        memory_region_add_subregion_overlap(sysmem, CH32_DBGMCU_BASE,
                                            &s->dbg_ram, 1);
    }

    ch32_afio_exti_init_mr(s, OBJECT(machine));
    memory_region_add_subregion_overlap(sysmem, CH32_AFIO_EXTI_BASE,
                                        &s->afio_exti_iomem, 2);

    ch32_gpio_init_mr(s, OBJECT(machine));
    memory_region_add_subregion_overlap(sysmem, CH32_GPIO_BLOCK_BASE,
                                        &s->gpio_iomem, 2);

    ch32_iwdt_init_mr(s, OBJECT(machine));
    memory_region_add_subregion_overlap(sysmem, CH32_IWDG_BASE,
                                        &s->iwdt_iomem, 3);

    /* TIM2~TIM7 MMIO 仿真（每个 1KB，优先级=2） */
    ch32_tim_init_all(s, OBJECT(machine));

    ch32_dma_init_mr(s, OBJECT(machine));
    memory_region_add_subregion_overlap(sysmem, CH32_DMA1_BLOCK_BASE,
                                        &s->dma.iomem, 1);
    {
        g_autofree char *n = g_strdup_printf("%s.ahb.crc-usbhs.ram", bd->tag);

        memory_region_init_ram_nomigrate(&s->ahb_misc_ram, OBJECT(machine), n,
                                         CH32_AHB_MISC_SIZE, &error_fatal);
        vmstate_register_ram_global(&s->ahb_misc_ram);
        memory_region_add_subregion_overlap(sysmem, CH32_AHB_MISC_BASE,
                                            &s->ahb_misc_ram, 1);
        ch32_ahb_misc_reset_defaults(s);
    }
    memory_region_init_io(&s->crc_iomem, OBJECT(machine), &ch32_crc_ops,
                          s, "ch32-crc", CH32_CRC_SIZE);
    memory_region_add_subregion_overlap(sysmem, CH32_CRC_BASE,
                                        &s->crc_iomem, 3);
    memory_region_init_io(&s->rng_iomem, OBJECT(machine), &ch32_rng_ops, s,
                          "ch32-rng-stub", CH32_RNG_SIZE);
    memory_region_add_subregion_overlap(sysmem, CH32_RNG_BASE, &s->rng_iomem, 3);
    ch32_usb_init_mr(s, OBJECT(machine));
    memory_region_add_subregion_overlap(sysmem, CH32_USBHS_BASE,
                                        &s->usbhs_iomem, 3);
    memory_region_add_subregion_overlap(sysmem, CH32_USBFS_BASE,
                                        &s->usbfs_iomem, 2);

    memory_region_init_io(&s->rcc_iomem, OBJECT(machine), &ch32_rcc_ops,
                          s, "ch32-rcc-stub", CH32_RCC_SIZE);
    memory_region_add_subregion_overlap(sysmem, CH32_RCC_BASE, &s->rcc_iomem, 1);

    memory_region_init_io(&s->rtc_iomem, OBJECT(machine), &ch32_rtc_ops, s,
                          "ch32-rtc-stub", CH32_RTC_SIZE);
    memory_region_add_subregion_overlap(sysmem, CH32_RTC_BASE, &s->rtc_iomem, 2);

    /* WWDG 窗口看门狗（地址 0x40002C00） */
    memory_region_init_io(&s->wwdg_iomem, OBJECT(machine), &ch32_wwdg_ops, s,
                          "ch32-wwdg", CH32_WWDG_SIZE);
    memory_region_add_subregion_overlap(sysmem, CH32_WWDG_BASE,
                                        &s->wwdg_iomem, 3);

    /* BKP 备份寄存器域（地址 0x40006C00） */
    memory_region_init_io(&s->bkp_iomem, OBJECT(machine), &ch32_bkp_ops, s,
                          "ch32-bkp", CH32_BKP_SIZE);
    memory_region_add_subregion_overlap(sysmem, CH32_BKP_BASE,
                                        &s->bkp_iomem, 2);

    /* PWR 电源控制（地址 0x40007000） */
    memory_region_init_io(&s->pwr_iomem, OBJECT(machine), &ch32_pwr_ops, s,
                          "ch32-pwr", CH32_PWR_SIZE);
    memory_region_add_subregion_overlap(sysmem, CH32_PWR_BASE,
                                        &s->pwr_iomem, 2);

    /* USART2/3 + UART4~8（轻量级仿真，DMA1/DMA2，手册表 18-2 ~ 18-9 基址） */
    ch32_usart_lite_init_mr(s, OBJECT(machine));
    memory_region_add_subregion_overlap(sysmem, CH32_USART2_BASE,
                                        &s->usart2.iomem, 2);
    memory_region_add_subregion_overlap(sysmem, CH32_USART3_BASE,
                                        &s->usart3.iomem, 2);
    memory_region_add_subregion_overlap(sysmem, CH32_UART6_BASE,
                                        &s->usart6.iomem, 2);
    memory_region_add_subregion_overlap(sysmem, CH32_UART7_BASE,
                                        &s->usart7.iomem, 2);
    memory_region_add_subregion_overlap(sysmem, CH32_UART8_BASE,
                                        &s->usart8.iomem, 2);
    memory_region_add_subregion_overlap(sysmem, CH32_UART4_BASE,
                                        &s->usart4.iomem, 2);
    memory_region_add_subregion_overlap(sysmem, CH32_UART5_BASE,
                                        &s->usart5.iomem, 2);

    /* SDIO stub（地址 0x40018000） */
    memory_region_init_io(&s->sdio_iomem, OBJECT(machine), &ch32_sdio_ops, s,
                          "ch32-sdio", CH32_SDIO_SIZE);
    memory_region_add_subregion_overlap(sysmem, CH32_SDIO_BASE,
                                        &s->sdio_iomem, 2);

    /* SPI1/SPI2/SPI3 stub */
    ch32_spi_init_mr(s, OBJECT(machine));
    memory_region_add_subregion_overlap(sysmem, 0x40013000ULL,
                                        &s->spi1_iomem, 2);
    memory_region_add_subregion_overlap(sysmem, 0x40003800ULL,
                                        &s->spi2_iomem, 2);
    memory_region_add_subregion_overlap(sysmem, 0x40003C00ULL,
                                        &s->spi3_iomem, 2);

    /* I2C1/I2C2 stub */
    ch32_i2c_init_mr(s, OBJECT(machine));
    memory_region_add_subregion_overlap(sysmem, 0x40005400ULL,
                                        &s->i2c1_iomem, 2);
    memory_region_add_subregion_overlap(sysmem, 0x40005800ULL,
                                        &s->i2c2_iomem, 2);

    /* RTC 实时计数状态由 ch32_soft_state_reset() 统一初始化 */

