lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-v.c
    /* 统一 PFIC IO handler：覆盖全部 0x1000 字节，包括 ISR/IPR/IENR/IRER/IPSR/IPRR/IACTR/IPRIOR/CFGR */
    memory_region_init_io(&s->pfic_io, OBJECT(machine), &ch32_pfic_ops, s,
                          "ch32-pfic", CH32_PFIC_SIZE);
    memory_region_add_subregion(sysmem, CH32_PFIC_BASE, &s->pfic_io);

    memory_region_init_io(&s->stk_iomem, OBJECT(machine), &ch32_stk_ops, s,
                          "ch32-stk", CH32_STK_SIZE);
    memory_region_add_subregion(sysmem, CH32_STK_BASE, &s->stk_iomem);

    {
        g_autofree char *esig_name = g_strdup_printf("%s.esig.rom", bd->tag);
        void *ep;

        memory_region_init_ram_nomigrate(&s->esig_rom, OBJECT(machine),
                                         esig_name, CH32_ESIG_SIZE, &error_fatal);
        vmstate_register_ram_global(&s->esig_rom);
        ep = memory_region_get_ram_ptr(&s->esig_rom);
        ch32_esig_populate(ep, CH32_ESIG_SIZE, bd, flash_sz);
        memory_region_set_readonly(&s->esig_rom, true);
        memory_region_add_subregion(sysmem, CH32_ESIG_BASE, &s->esig_rom);
    }

    memory_region_init_io(&s->flash_reg_iomem, OBJECT(machine), &ch32_flashreg_ops,
                          s, "ch32-flash-regs", CH32_FLASHREG_SIZE);
    memory_region_add_subregion_overlap(sysmem, CH32_FLASHREG_BASE,
                                        &s->flash_reg_iomem, 1);

    {
        g_autofree char *n = g_strdup_printf("%s.periph.bus.ram", bd->tag);

        /*
         * 外设总线背景 IO region：读返回 0，写忽略。
         * 之前用 RAM（memory_region_init_ram_nomigrate）会产生
         * TLB_NOTDIRTY 条目，导致 ETH MMIO（IO region， overlap
         * 优先级 10）被 RAM notdirty TLB 条目污染，最终
         * iotlb_to_section 断言失败。改用 IO region 后 QEMU
         * TCG TLB 对 IO region 使用普通 MMIO 路径，不
         * 会与高优先级 overlap MMIO 产生冲突。
         */
        memory_region_init_io(&s->periph_bus_ram, OBJECT(machine),
                              &ch32_sram_gap_ops, NULL, n,
                              CH32_PERIPH_BUS_SIZE);
        memory_region_add_subregion_overlap(sysmem, CH32_PERIPH_BUS_BASE,
                                            &s->periph_bus_ram, 0);
    }
    {
        static const hwaddr adc_bases[3] = {
            CH32_ADC1_BASE, CH32_ADC2_BASE, CH32_ADC3_BASE,
        };
        unsigned i;

        for (i = 0; i < 3; i++) {
            g_autofree char *an =
                g_strdup_printf("%s.adc%u.evt", bd->tag, i + 1u);

            memory_region_init_io(&s->adc_evt_iomem[i], OBJECT(machine),
                                  &ch32_adc_evt_ops, NULL, an,
                                  CH32_ADC_EVT_SIZE);
            memory_region_add_subregion_overlap(sysmem, adc_bases[i],
                                                &s->adc_evt_iomem[i], 4);
        }
    }

    if (bd->default_nic) {
        if (!strcmp(bd->default_nic, "ch32-eth-10m")) {
            /* CH32V20x_D8 ETH10M（10M MAC，与 EMAC+DMA 完全不同） */
            DeviceState *edev = qdev_new(TYPE_CH32_ETH_10M);

            qemu_configure_nic_device(edev, true, NULL);
            sysbus_realize_and_unref(SYS_BUS_DEVICE(edev), &error_fatal);
            memory_region_add_subregion_overlap(
                sysmem, CH32_ETH_MMIO_BASE,
                sysbus_mmio_get_region(SYS_BUS_DEVICE(edev), 0), 10);
            ch32_eth_10m_set_machine(edev, s);
        } else if (!strcmp(bd->default_nic, "ch32-eth-dwmac-10m")) {
            /*
             * CH32V307：标准 EMAC+DMA MAC 控制器（寄存器布局与 CH32V317 相同），
             * 内置 10M PHY（通过 EXTEN_CTR.ETH_10M_EN 使能）。设置 phy-model="phy10m"
             * 使 PHY 模拟返回 10M 默认值、ANLPAR=0 等。
             */
            DeviceState *edev = qdev_new(TYPE_CH32_ETH_DWMAC);

            qdev_prop_set_string(edev, "phy-model", "phy10m");
            qemu_configure_nic_device(edev, true, NULL);
            sysbus_realize_and_unref(SYS_BUS_DEVICE(edev), &error_fatal);
            memory_region_add_subregion_overlap(
                sysmem, CH32_ETH_MMIO_BASE,
                sysbus_mmio_get_region(SYS_BUS_DEVICE(edev), 0), 10);
            ch32_eth_set_machine(edev, s);
        } else if (!strcmp(bd->default_nic, "ch32-eth-dwmac-rtl8211f")) {
            /*
             * CH32V307/CH32V317（新默认）：标准 EMAC+DMA MAC 通过 RGMII 外接
             * Realtek RTL8211F 千兆 PHY。设置 phy-model="rtl8211f" 启用
             * RTL8211F Clause22/Page0xd04/MMD 寄存器模型；BCR 复位值 0x1140
             * 以兑现千兆 FD 自协商结果，PHYSR link-up 后返回 1000M FD 0x002C。
             */
            DeviceState *edev = qdev_new(TYPE_CH32_ETH_DWMAC);

            qdev_prop_set_string(edev, "phy-model", "rtl8211f");
            qemu_configure_nic_device(edev, true, NULL);
            sysbus_realize_and_unref(SYS_BUS_DEVICE(edev), &error_fatal);
            memory_region_add_subregion_overlap(
                sysmem, CH32_ETH_MMIO_BASE,
                sysbus_mmio_get_region(SYS_BUS_DEVICE(edev), 0), 10);
            ch32_eth_set_machine(edev, s);
        } else {
            /* CH32V30x / V317 等标准 EMAC+DMA ETH */
            DeviceState *edev = qdev_new(TYPE_CH32_ETH_DWMAC);

            qemu_configure_nic_device(edev, true, NULL);
            sysbus_realize_and_unref(SYS_BUS_DEVICE(edev), &error_fatal);
            memory_region_add_subregion_overlap(
                sysmem, CH32_ETH_MMIO_BASE,
                sysbus_mmio_get_region(SYS_BUS_DEVICE(edev), 0), 10);
            /*
             * 设置 ETH 外设反向指针，供 ch32_eth_meip_resync 通过 machine 指针
             * 访问 pfic_ienr 和 CPU env，实现 ETH_IRQn=77 中断路由。
             */
            ch32_eth_set_machine(edev, s);
        }
    }

    /*
     * 注册 VTF mret 回调：在 helper_mret 的 VTF 返回路径调用
     * ch32_pfic_on_mret，清除 IACTR/override/MEIP 并重扫挂起中断。
     */
    ch32_pfic_register_mret_cb(s);
}

#define CH32_M_STR(s) #s
#define CH32_MACHINE_ONE(mach, bdglobal)                                      \
    static void mach##_machine_init(MachineState *machine)                      \
    {                                                                           \
        ch32_machine_init(machine, &bdglobal);                                  \
    }                                                                           \
    static void mach##_machine_class_init(ObjectClass *oc, const void *data)  \
    {                                                                           \
        MachineClass *mc = MACHINE_CLASS(oc);                                   \
        const Ch32BoardDesc *bd = &bdglobal;                                    \
        (void)data;                                                             \
        mc->desc = bd->pretty;                                                   \
        mc->init = mach##_machine_init;                                         \
        mc->reset = ch32_machine_reset;                                         \
        mc->max_cpus = 1;                                                       \
        mc->default_cpu_type = bd->default_cpu_type;                            \
        mc->valid_cpu_types = bd->valid_cpu_types;                              \
        mc->default_ram_size = bd->default_ram_size;                            \
        mc->default_ram_id = bd->ram_id;                                        \
        if (bd->default_nic) {                                                  \
            mc->default_nic = bd->default_nic;                                 \
        }                                                                        \
        object_class_property_add_str(oc, "flash-image",                         \
                                      ch32_prop_get_flash_image,               \
                                      ch32_prop_set_flash_image);               \
        object_class_property_add_str(oc, "flash-size",                        \
                                      ch32_prop_get_flash_size,                \
                                      ch32_prop_set_flash_size);                \
        object_class_property_add_str(oc, "boot-mode",                          \
                                      ch32_prop_get_boot_mode,                 \
                                      ch32_prop_set_boot_mode);                \
    }                                                                           \
    static const TypeInfo mach##_machine_typeinfo = {                           \
        .name = MACHINE_TYPE_NAME(CH32_M_STR(mach)),                            \
        .parent = TYPE_MACHINE,                                                 \
        .class_init = mach##_machine_class_init,                                \
        .instance_size = sizeof(Ch32MachineState),                              \
        .instance_init = ch32_machine_instance_init,                            \
        .instance_finalize = ch32_machine_finalize,                             \
    };                                                                          \
    static void mach##_machine_register_types(void)                             \
    {                                                                           \
        type_register_static(&mach##_machine_typeinfo);                         \
    }                                                                           \
    type_init(mach##_machine_register_types)

CH32_MACHINE_ONE(ch32v317, ch32_board_ch32v317)
CH32_MACHINE_ONE(ch32v307, ch32_board_ch32v307)
CH32_MACHINE_ONE(ch32v305, ch32_board_ch32v305)
CH32_MACHINE_ONE(ch32v303, ch32_board_ch32v303)
CH32_MACHINE_ONE(ch32v203, ch32_board_ch32v203)
CH32_MACHINE_ONE(ch32v203rb, ch32_board_ch32v203rb)
CH32_MACHINE_ONE(ch32v103, ch32_board_ch32v103)
CH32_MACHINE_ONE(ch32v003, ch32_board_ch32v003)
CH32_MACHINE_ONE(ch32v407, ch32_board_ch32v407)
CH32_MACHINE_ONE(ch32h417, ch32_board_ch32h417)
